#### Sreelal H

### Evaluate the dataset of the Summer Olympics, London 2012

In [2]:
import pandas as pd

In [3]:
file=pd.read_excel("Olympic 2012 Medal Tally.xlsx",header=[1,2])

In [4]:
file.head()

  Unnamed: 0_level_0            Country       Country Code               Year  \
  Unnamed: 0_level_1 Unnamed: 1_level_1 Unnamed: 2_level_1 Unnamed: 3_level_1
0                NaN      Great Britain                GBR               2012
1                NaN             China                 CHN               2012
2                NaN             Russia                RUS               2012
3                NaN      United States                 US               2012
4                NaN              Korea                KOR               2012

  Medal Tally
         Gold Silver Bronze
0          29     17     19
1          38     28     22
2          24     25     32
3          46     28     29
4          13      8      7

In [7]:
#Find and print the name of the country that won maximum gold medals.
k=file['Country'].loc[file['Medal Tally']['Gold'].idxmax()]
print("Country that won the maximum medal is: ",k)

Country that won the maximum medal is:  Unnamed: 1_level_1    United States
Name: 3, dtype: object

In [8]:
#Find and print the countries who won more than 20 gold medals.

file['Country'].loc[file['Medal Tally']['Gold']>20]

  Unnamed: 1_level_1
0      Great Britain
1             China
2             Russia
3      United States

In [9]:
#Print the medal tally.

file['Medal Tally']

   Gold  Silver  Bronze
0    29      17      19
1    38      28      22
2    24      25      32
3    46      28      29
4    13       8       7
5     7      14      17
6    11      11      14

In [10]:
#Print each country name with the corresponding number of gold medals.

file_new=file[['Country','Medal Tally']]
file_new.drop(file_new.iloc[:, 2:4], inplace = True,axis=1)

/home/lal/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [11]:
file_new

             Country Medal Tally
  Unnamed: 1_level_1        Gold
0      Great Britain          29
1             China           38
2             Russia          24
3      United States          46
4              Korea          13
5              Japan           7
6            Germany          11

In [12]:
#Print each country name with the total number of medals won.

med_tot=file['Medal Tally'].sum(axis=1)

In [13]:
file['med_tot']=med_tot

In [15]:
file[['Country','med_tot']]

             Country med_tot
  Unnamed: 1_level_1
0      Great Britain      65
1             China       88
2             Russia      81
3      United States     103
4              Korea      28
5              Japan      38
6            Germany      36